In [32]:
import pandas as pd

In [33]:
import numpy as np

In [34]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                 'NAME':['A','B','C','D'],
                 'SUB':['SUB1','SUB2','SUB3','SUB4']})

In [35]:
df1

   ID NAME   SUB
0   1    A  SUB1
1   2    B  SUB2
2   3    C  SUB3
3   4    D  SUB4

In [36]:
df2=pd.DataFrame({'ID':[1,2,3,4],
                 'NAME':['E','F','G','H'],
                 'SUB':['SUB3','SUB4','SUB5','SUB6']})

In [37]:
df2

   ID NAME   SUB
0   1    E  SUB3
1   2    F  SUB4
2   3    G  SUB5
3   4    H  SUB6

In [38]:
pd.concat([df1,df2],axis=0).reset_index()

   index  ID NAME   SUB
0      0   1    A  SUB1
1      1   2    B  SUB2
2      2   3    C  SUB3
3      3   4    D  SUB4
4      0   1    E  SUB3
5      1   2    F  SUB4
6      2   3    G  SUB5
7      3   4    H  SUB6

In [39]:
pd.concat([df1,df2],axis=1)

   ID NAME   SUB  ID NAME   SUB
0   1    A  SUB1   1    E  SUB3
1   2    B  SUB2   2    F  SUB4
2   3    C  SUB3   3    G  SUB5
3   4    D  SUB4   4    H  SUB6

In [40]:
pd.merge(left=df1,right=df2,on='SUB')

   ID_x NAME_x   SUB  ID_y NAME_y
0     3      C  SUB3     1      E
1     4      D  SUB4     2      F

In [41]:
pd.merge(left=df1,right=df2,on='SUB',how='left')

   ID_x NAME_x   SUB  ID_y NAME_y
0     1      A  SUB1   NaN    NaN
1     2      B  SUB2   NaN    NaN
2     3      C  SUB3   1.0      E
3     4      D  SUB4   2.0      F

In [42]:
pd.merge(left=df1,right=df2,on='SUB',how='right')

   ID_x NAME_x   SUB  ID_y NAME_y
0   3.0      C  SUB3     1      E
1   4.0      D  SUB4     2      F
2   NaN    NaN  SUB5     3      G
3   NaN    NaN  SUB6     4      H

In [43]:
pd.merge(left=df1,right=df2,on='SUB',how='outer')

   ID_x NAME_x   SUB  ID_y NAME_y
0   1.0      A  SUB1   NaN    NaN
1   2.0      B  SUB2   NaN    NaN
2   3.0      C  SUB3   1.0      E
3   4.0      D  SUB4   2.0      F
4   NaN    NaN  SUB5   3.0      G
5   NaN    NaN  SUB6   4.0      H

In [44]:
df3=pd.DataFrame({'ID':[1],
                 'Employee_Name':'I',
                 'SUB':'SUB7'})

In [45]:
df3

   ID Employee_Name   SUB
0   1             I  SUB7

In [46]:
df4=df1.append(df3)

In [47]:
df4.reset_index(inplace=True)
df4

   index  ID NAME   SUB Employee_Name
0      0   1    A  SUB1           NaN
1      1   2    B  SUB2           NaN
2      2   3    C  SUB3           NaN
3      3   4    D  SUB4           NaN
4      0   1  NaN  SUB7             I

In [48]:
df4.drop('index',inplace=True,axis=1)
df4

   ID NAME   SUB Employee_Name
0   1    A  SUB1           NaN
1   2    B  SUB2           NaN
2   3    C  SUB3           NaN
3   4    D  SUB4           NaN
4   1  NaN  SUB7             I

In [49]:
market_df=pd.read_csv('C:\\Users\\sree\\Desktop\\jupyter\\data science\\supermarkets\\supermarkets.csv')
market_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [50]:
market_df['Employees']>15

0    False
1    False
2     True
3    False
4    False
5     True
Name: Employees, dtype: bool

In [51]:
market_df[market_df['Employees']>=15]

,ID,Address,City,State,Country,Name,Employees
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [52]:
market_df[market_df['State']=='CA 94114']

   ID          Address           City     State Country        Name  Employees
0   1     3666 21st St  San Francisco  CA 94114     USA     Madeira          8
3   4     3995 23rd St  San Francisco  CA 94114     USA  Ben's Shop         10
5   6  551 Alvarado St  San Francisco  CA 94114     USA  Richvalley         20

In [53]:
market_df[(market_df['State']=='CA 94114')&(market_df['Employees']>=15)]

   ID          Address           City     State Country        Name  Employees
5   6  551 Alvarado St  San Francisco  CA 94114     USA  Richvalley         20

In [54]:
market_df[(market_df['State']=='CA 94114')|(market_df['Employees']>=15)]

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [55]:
market_df[(market_df['State']=='CA 94114')&~(market_df['Employees']>=15)]

   ID       Address           City     State Country        Name  Employees
0   1  3666 21st St  San Francisco  CA 94114     USA     Madeira          8
3   4  3995 23rd St  San Francisco  CA 94114     USA  Ben's Shop         10

In [56]:
new_tuple=[('Suma','Subject1'),('Suma','Subject2'),
          ('Hima','Subject1'),('Hima','Subject2'),
          ('Nani','Subject1'),('Nani','Subject2')]

In [57]:
index=pd.MultiIndex.from_tuples(new_tuple)

In [58]:
Values=[['Science',98],['Maths',99],
       ['Science',95],['Maths',90],
       ['Science',90],['Maths',89]]

In [59]:
marks_df=pd.DataFrame(Values,index=index,columns=['Subject_Name','Marks'])

In [60]:
marks_df

              Subject_Name  Marks
Suma Subject1      Science     98
     Subject2        Maths     99
Hima Subject1      Science     95
     Subject2        Maths     90
Nani Subject1      Science     90
     Subject2        Maths     89

In [61]:
marks_df.set_index(['Name','Subject'])

KeyError: "None of ['Name', 'Subject'] are in the columns"

In [62]:
pip install seaborn

Requirement already satisfied: seaborn in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (0.11.0)
Requirement already satisfied: pandas>=0.23 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.0.5)
Requirement already satisfied: numpy>=1.15 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.19.0)
Requirement already satisfied: scipy>=1.0 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.5.2)
Requirement already satisfied: matplotlib>=2.2 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (3.3.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from pandas>=0.23->seaborn) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from pandas>=0.23->seaborn) (2020.1)
Requirement already satisfied: certifi>=2020.06.20 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (2020.6.20)
Requirement already satisfied: cycler>=0.10 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: pillow>=6.2.0 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (7.2.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (1.2.0)
Requirement already satisfied: six>=1.5 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.23->seaborn) (1.15.0)Note: you may need to restart the kernel to use updated packages.

In [63]:
import seaborn as sns

In [64]:
tips=sns.load_dataset('tips')

In [65]:
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [66]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.0 KB

In [67]:
tips['sex'].unique()

[Female, Male]
Categories (2, object): [Female, Male]

In [68]:
tips['time'].unique()

[Dinner, Lunch]
Categories (2, object): [Dinner, Lunch]

In [69]:
tips[(tips.time=='Dinner')]['tip'].sum()

546.0699999999999

In [70]:
tips[(tips.time=='Lunch')]['tip'].sum()

185.51000000000002

In [71]:
tips[(tips.time=='Dinner')]['tip'].mean()

3.102670454545454

In [72]:
tips[(tips.time=='Lunch')]['tip'].mean()

2.728088235294118

In [73]:
tips[(tips.time=='Morning')]['tip'].sum()

0.0

In [74]:
tips[(tips.time=='Morning')]

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

In [75]:
tips[(tips.sex)=='Female']['tip'].mean()

2.8334482758620685

In [76]:
tips[(tips.sex)=='Male']['tip'].mean()

3.0896178343949043

In [77]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [78]:
tips['tip'].mean()/tips['total_bill'].mean()

0.15153580224410027

In [79]:
tips[tips.time=='Lunch'].mean()

total_bill    17.168676
tip            2.728088
size           2.411765
dtype: float64

In [80]:
tips[tips.time=='Dinner'].mean()

total_bill    20.797159
tip            3.102670
size           2.630682
dtype: float64

In [81]:
tips[tips['time']=='Lunch'].mean()/tips[tips['time']=='Dinner'].mean()

total_bill    0.825530
tip           0.879271
size          0.916783
dtype: float64

In [82]:
tips['tip'].std()

1.3836381890011822

In [83]:
tips['tip'].head(10).std()

1.1150331335385908

In [84]:
tips['tip'].max()

10.0

In [85]:
tips['tip'].skew()

1.4654510370979401

In [86]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [88]:
tips[tips['size']==1].mean()/tips[tips['size']>1].mean()

total_bill    0.362216
tip           0.475318
size          0.385233
dtype: float64

In [96]:
tips['tip_per']=tips['tip']/tips['total_bill']

In [97]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   total_bill      244 non-null    float64
 1   tip             244 non-null    float64
 2   sex             244 non-null    category
 3   smoker          244 non-null    category
 4   day             244 non-null    category
 5   time            244 non-null    category
 6   size            244 non-null    int64
 7   tip_per_person  244 non-null    float64
 8   tip_per         244 non-null    float64
dtypes: category(4), float64(4), int64(1)
memory usage: 10.8 KB

In [98]:
tips.head(10)

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_per
0,16.99,1.01,Female,No,Sun,Dinner,2,8.495000,0.059447
1,10.34,1.66,Male,No,Sun,Dinner,3,3.446667,0.160542
2,21.01,3.50,Male,No,Sun,Dinner,3,7.003333,0.166587
3,23.68,3.31,Male,No,Sun,Dinner,2,11.840000,0.139780
4,24.59,3.61,Female,No,Sun,Dinner,4,6.147500,0.146808
5,25.29,4.71,Male,No,Sun,Dinner,4,6.322500,0.186240
6,8.77,2.00,Male,No,Sun,Dinner,2,4.385000,0.228050
7,26.88,3.12,Male,No,Sun,Dinner,4,6.720000,0.116071
8,15.04,1.96,Male,No,Sun,Dinner,2,7.520000,0.130319
9,14.78,3.23,Male,No,Sun,Dinner,2,7.390000,0.218539

In [100]:
tips[tips['size']==1]['tip_per'].mean()/tips[tips['size']>1]['tip_per'].mean()

1.3592551752954416

In [101]:
tips[tips['sex']=='Female']['tip_per'].mean()/tips[tips['sex']=='Male']['tip_per'].mean()

1.056074587070011